# _______Множества (set и frozenset)_____________
# data = set('hello') # преобразовывает текст в множество удаляет повторяющиеся символы
data = {5, 7, 4, 3, 5}

data.add(32)# добавляем число к множеству
data.update(['32', True, 4, 6])# добавляем другие типы данных к множеству
data.remove(True) # удаляем элемент из множества
data.pop() # удаляем 1 й элемент
# data.clear() # очистить все множество

nums = [5, 7, 3, 5, 5] # сделали список
nums = set(nums) # сделали список множеством
# print(nums)
# __________frozenset__________
new_data = frozenset([5, 7, 3, 5, 5, '32', True, 4, 6])


print(new_data)